Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71Q20.atdf
        <register caption="SDRAMC Interrupt Status Register" name="SDRAMC_ISR" offset="0x20" rw="R" size="4" atomic-op="clear:SDRAMC_ISR">
          <bitfield caption="Refresh Error Status (cleared on read)" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Memory Device Register" name="SDRAMC_MDR" offset="0x24" rw="RW" size="4">
          <bitfield caption="Memory Device Type" mask="0x00000003" name="MD" values="SDRAMC_MDR__MD"/>
        </register>
        <register caption="SDRAMC Configuration Register 1" name="SDRAMC_CFR1" offset="0x28" rw="RW" size="4">
          <bitfield caption="Load Mode Register Command to Active or Refresh Command" mask="0x0000000F" name="TMRD"/>
          <bitfield caption="Support Unaligned Access" mask="0x00000100" name="UNAL" values="SDRAMC_CFR1__UNAL"/>
        </register>
        <register caption="SDRAMC OCMS Register" name="SDRAMC_OCMS" offset="0x2C" rw="RW" size="4">
          <bitfield caption="SDRAM Memory Controller Scrambling Enable" mask="0x00000001" name="SDR_SE"/>
        </register>
        <register caption="SDRAMC OCMS KEY1 Register" name="SDRAMC_OCMS_KEY1" offset="0x30" rw="W" size="4">
          <bitfield caption="Off-chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="SDRAMC OCMS KEY2 Register" name="SDRAMC_OCMS_KEY2" offset="0x34" rw="W" size="4">
          <bitfield caption="Off-chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="SDRAMC Version Register" name="SDRAMC_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="SDRAMC_MR__MODE">
        <value caption="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM." name="NORMAL" value="0x0"/>
        <value caption="The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="NOP" value="0x1"/>
        <value caption="The SDRAMC issues an &#34;All Banks Precharge&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="ALLBANKS_PRECHARGE" value="0x2"/>
        <value caption="The SDRAMC issues a &#34;Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="LOAD_MODEREG" value="0x3"/>
        <value caption="The SDRAMC issues an &#34;Auto-Refresh&#34; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &#34;All Banks Precharge&#34; command must be issued. To activate this mode, the command must be followed by a write to the SDRAM." name="AUTO_REFRESH" value="0x4"/>
        <value caption="The SDRAMC issues an &#34;Extended Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &#34;Extended Load Mode Register&#34; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." name="EXT_LOAD_MODEREG" value="0x5"/>
        <value caption="Deep Power-down mode. Enters Deep Power-down mode." name="DEEP_POWERDOWN" value="0x6"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NC">
        <value caption="8 column bits" name="COL8" value="0x0"/>
        <value caption="9 column bits" name="COL9" value="0x1"/>
        <value caption="10 column bits" name="COL10" value="0x2"/>
        <value caption="11 column bits" name="COL11" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NR">
        <value caption="11 row bits" name="ROW11" value="0x0"/>
        <value caption="12 row bits" name="ROW12" value="0x1"/>
        <value caption="13 row bits" name="ROW13" value="0x2"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NB">
        <value caption="2 banks" name="BANK2" value="0"/>
        <value caption="4 banks" name="BANK4" value="1"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__CAS">
        <value caption="1 cycle latency" name="LATENCY1" value="0x1"/>
        <value caption="2 cycle latency" name="LATENCY2" value="0x2"/>
        <value caption="3 cycle latency" name="LATENCY3" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_LPR__LPCB">
        <value caption="The low-power feature is inhibited: no Power-down, Self-refresh or Deep Power-down command is issued to the SDRAM device." name="DISABLED" value="0x0"/>
        <value caption="The SDRAMC issues a Self-refresh command to the SDRAM device, the SDCK clock is deactivated and the SDCKE signal is set low. The SDRAM device leaves the Self-refresh mode when accessed and enters it after the access." name="SELF_REFRESH" value="0x1"/>
        <value caption="The SDRAMC issues a Power-down Command to the SDRAM device after each access, the SDCKE signal is set to low. The SDRAM device leaves the Power-down mode when accessed and enters it after the access." name="POWER_DOWN" value="0x2"/>
        <value caption="The SDRAMC issues a Deep Power-down command to the SDRAM device. This mode is unique to low-power SDRAM." name="DEEP_POWER_DOWN" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_LPR__TIMEOUT">
        <value caption="The SDRAMC activates the SDRAM Low-power mode immediately after the end of the last transfer." name="LP_LAST_XFER" value="0x0"/>
        <value caption="The SDRAMC activates the SDRAM Low-power mode 64 clock cycles after the end of the last transfer." name="LP_LAST_XFER_64" value="0x1"/>
        <value caption="The SDRAMC activates the SDRAM Low-power mode 128 clock cycles after the end of the last transfer." name="LP_LAST_XFER_128" value="0x2"/>
      </value-group>
      <value-group caption="" name="SDRAMC_MDR__MD">
        <value caption="SDRAM" name="SDRAM" value="0"/>
        <value caption="Low-power SDRAM" name="LPSDRAM" value="1"/>
      </value-group>
