Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71Q20.atdf
      <value-group caption="" name="SMC_MODE0__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module name="SPI" caption="Serial Peripheral Interface" id="6088" version="ZK">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x00010000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x00020000" name="RXFCLR"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
        </register>
