Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71Q20.atdf
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="WKUP Wakeup Status (cleared on read)" mask="0x00000002" name="WKUPS" values="SUPC_SR__WKUPS"/>
          <bitfield caption="Supply Monitor Detection Wakeup Status (cleared on read)" mask="0x00000004" name="SMWS" values="SUPC_SR__SMWS"/>
          <bitfield caption="Brownout Detector Reset Status (cleared on read)" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status (cleared on read)" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status (cleared on read)" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32-kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
          <bitfield caption="Low-power Debouncer Wakeup Status on WKUP0 (cleared on read)" mask="0x00002000" name="LPDBCS0" values="SUPC_SR__LPDBCS0"/>
          <bitfield caption="Low-power Debouncer Wakeup Status on WKUP1 (cleared on read)" mask="0x00004000" name="LPDBCS1" values="SUPC_SR__LPDBCS1"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00010000" name="WKUPIS0" values="SUPC_SR__WKUPIS0"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00020000" name="WKUPIS1" values="SUPC_SR__WKUPIS1"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00040000" name="WKUPIS2" values="SUPC_SR__WKUPIS2"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00080000" name="WKUPIS3" values="SUPC_SR__WKUPIS3"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00100000" name="WKUPIS4" values="SUPC_SR__WKUPIS4"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00200000" name="WKUPIS5" values="SUPC_SR__WKUPIS5"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00400000" name="WKUPIS6" values="SUPC_SR__WKUPIS6"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x00800000" name="WKUPIS7" values="SUPC_SR__WKUPIS7"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x01000000" name="WKUPIS8" values="SUPC_SR__WKUPIS8"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x02000000" name="WKUPIS9" values="SUPC_SR__WKUPIS9"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x04000000" name="WKUPIS10" values="SUPC_SR__WKUPIS10"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x08000000" name="WKUPIS11" values="SUPC_SR__WKUPIS11"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x10000000" name="WKUPIS12" values="SUPC_SR__WKUPIS12"/>
          <bitfield caption="WKUPx Input Status (cleared on read)" mask="0x20000000" name="WKUPIS13" values="SUPC_SR__WKUPIS13"/>
        </register>
        <register caption="Version Register" name="SYSC_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__VROFF">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, VROFF asserts the vddcore_nreset and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, XTALSEL switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enabled one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enabled one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enabled one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="The SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The core reset signal, vddcore_nreset is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="The core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="The core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
